In [13]:
import mysql.connector
import pandas as pd

In [14]:
myDB = mysql.connector.connect(
    host = "localhost",
    port = 3306,
    user = 'ksmrdn',
    passwd = '1234567',
    database = 'warehouse_rk')

In [15]:
myDB

In [16]:
csr = myDB.cursor()
csr

In [24]:
csr.execute('select * from  karyawan')
x = csr.fetchall()
listX = []
for data in x:
    listX.append(data)
listX

[(1,
  {'pria'},
  'Faishal Zafran',
  2500000,
  None,
  datetime.datetime(2019, 11, 21, 9, 35, 7),
  None),
 (2,
  {'wanita'},
  'Salma Fina',
  2500000,
  None,
  datetime.datetime(2019, 11, 21, 9, 38, 42),
  None),
 (3,
  {'pria'},
  'Sujiwo Tejo',
  8500000,
  None,
  datetime.datetime(2019, 11, 21, 9, 38, 42),
  None),
 (4,
  {'wanita'},
  'Bonita Bonek',
  4000000,
  None,
  datetime.datetime(2019, 11, 21, 9, 51, 24),
  None),
 (9,
  None,
  'Fiersa Besari',
  4500000,
  'JL. Pinus Berduri 3 No.15',
  datetime.datetime(2019, 11, 21, 12, 33, 32),
  None),
 (11,
  None,
  'Vincentius Jefri',
  10000000,
  'JL. Ende Flore 5',
  datetime.datetime(2019, 11, 21, 12, 34, 16),
  None),
 (13,
  None,
  'Fiersa Besari',
  4500000,
  'JL. Pinus Berduri 3 No.15',
  datetime.datetime(2019, 11, 21, 22, 1, 38),
  None),
 (14,
  None,
  'Flora Bowie',
  2500000,
  None,
  datetime.datetime(2019, 11, 22, 9, 28, 13),
  None),
 (15,
  None,
  'Flora Bowie',
  2500000,
  None,
  datetime.datetime(2019, 11, 22, 9, 28, 30),
  None)]

In [28]:
dfData = pd.DataFrame(listX, columns=['No','Jenis Kelamin','Nama','Gaji','Alamat','Date Time','Hobi'])
dfData

,No,Jenis Kelamin,Nama,Gaji,Alamat,Date Time,Hobi
0,1,{pria},Faishal Zafran,2500000,None,2019-11-21 09:35:07,None
1,2,{wanita},Salma Fina,2500000,None,2019-11-21 09:38:42,None
2,3,{pria},Sujiwo Tejo,8500000,None,2019-11-21 09:38:42,None
3,4,{wanita},Bonita Bonek,4000000,None,2019-11-21 09:51:24,None
4,9,None,Fiersa Besari,4500000,JL. Pinus Berduri 3 No.15,2019-11-21 12:33:32,None
5,11,None,Vincentius Jefri,10000000,JL. Ende Flore 5,2019-11-21 12:34:16,None
6,13,None,Fiersa Besari,4500000,JL. Pinus Berduri 3 No.15,2019-11-21 22:01:38,None
7,14,None,Flora Bowie,2500000,None,2019-11-22 09:28:13,None
8,15,None,Flora Bowie,2500000,None,2019-11-22 09:28:30,None